app/views/gossips/show.html.erb

 <h3><%= "Gossip  de   #{@gossip_precis.user.first_name} #{@gossip_precis.user.last_name}" %></h3>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]


 <% @gossip_precis.comments.each do |c|%>
 <%= "#{c.content}"%> <br>
 <%= "#{c.user.first_name}  #{c.user.last_name}"%><br>
---
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 204]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 128], ["LIMIT", 1]]