app/controllers/session_controller.rb

def create
  # cherche s'il existe un utilisateur en base avec l’e-mail
  @user = User.find_by(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "arno@nym.ous"], ["LIMIT", 1]]