app/controllers/users_controller.rb

	def show
		@user_precis = User.find(params[:id])
		@user_city_id = @user_precis.city_id
		@user_city = City.find(@user_city_id).name
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]

	def create
		if City.find_by(name: params[:city_name])
			@city_db = City.find_by(name: params[:city_name])
			@user = User.new(email: params[:email], password: params[:password],
				first_name: params[:first_name], last_name: params[:last_name],
				age: params[:age], city: @city_db)
			puts "*" * 100
			puts @user.first_name
			puts @city_db.name
			@user.save
		else
			@city = City.new(name: params[:city_name], zip_code: params[:zip_code])
			# @city.name = params[:city_name]
			# @city.zip_code =  params[:zip_code]
			@user = User.new(email: params[:email], password: params[:password],
				first_name: params[:first_name], last_name: params[:last_name],
				age: params[:age], city: @city)
			puts "*" * 100
			puts @user.first_name
			puts @city.name

			@user.save
---
SELECT  "cities".* FROM "cities" WHERE "cities"."name" = $1 LIMIT $2  [["name", "lyon"], ["LIMIT", 1]]
INSERT INTO "users" ("first_name", "last_name", "email", "age", "city_id", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"